In [ ]:
import numpy as np
import pandas as pd

#The Machine learning alogorithm
from sklearn.ensemble import RandomForestClassifier

# Test train split
from sklearn.cross_validation import train_test_split


# Just to switch off pandas warning
pd.options.mode.chained_assignment = None


# Used to write our model to a file
from sklearn.externals import joblib

# read test data from csv file using panda library
data = pd.read_csv("titanic_train.csv")
data.head()

In [5]:
data.columns

Index(['Unnamed: 0', 'row.names', 'pclass', 'survived', 'name', 'age',
       'embarked', 'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [6]:
data['age'].head()

0     NaN
1    65.0
2    59.0
3    46.0
4     NaN
Name: age, dtype: float64

In [8]:
data['age'].median()

29.0

In [12]:
data['sex'].unique()

array(['female', 'male'], dtype=object)

In [13]:
median_age = data['age'].median()
print('median age is {}'.format(median_age))

median age is 29.0

In [14]:
data['age'].fillna(median_age, inplace = True)
data['age'].head()

0    29.0
1    65.0
2    59.0
3    46.0
4    29.0
Name: age, dtype: float64

In [16]:
data.columns

Index(['Unnamed: 0', 'row.names', 'pclass', 'survived', 'name', 'age',
       'embarked', 'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [20]:
data_inputs = data[['pclass','age','sex']]
data_inputs.head()

  pclass   age     sex
0    3rd  29.0  female
1    1st  65.0    male
2    2nd  59.0    male
3    1st  46.0    male
4    3rd  29.0    male

In [21]:
expected_output = data[['survived']]
expected_output.head()

   survived
0         1
1         0
2         0
3         0
4         0

In [22]:
data_inputs['pclass'].replace("3rd", 3, inplace = True)
data_inputs.head()

  pclass   age     sex
0      3  29.0  female
1    1st  65.0    male
2    2nd  59.0    male
3    1st  46.0    male
4      3  29.0    male

In [23]:
data_inputs['pclass'].replace("2nd", 2, inplace = True)
data_inputs.head()

  pclass   age     sex
0      3  29.0  female
1    1st  65.0    male
2      2  59.0    male
3    1st  46.0    male
4      3  29.0    male

In [24]:
data_inputs['pclass'].replace("1st", 1, inplace = True)
data_inputs.head()

   pclass   age     sex
0       3  29.0  female
1       1  65.0    male
2       2  59.0    male
3       1  46.0    male
4       3  29.0    male

In [25]:
data_inputs['sex'].replace("female",0,inplace = True)
data_inputs.head()

   pclass   age   sex
0       3  29.0     0
1       1  65.0  male
2       2  59.0  male
3       1  46.0  male
4       3  29.0  male

In [26]:
data_inputs['sex'].replace("male",1,inplace = True)
data_inputs.head()

   pclass   age  sex
0       3  29.0    0
1       1  65.0    1
2       2  59.0    1
3       1  46.0    1
4       3  29.0    1